//: Playground - noun: a place where people can play

import UIKit

/*:
 ## Practice
 */

/*:
 ---
1. 이름을 입력 값으로 받아서 출력하는 함수
 ---
 */

/*:
 ---
 2. 나이를 입력 값으로 받아서 출력하는 함수
 ---
 */

/*:
 ---
 3. 이름과 나이를 입력 받아 자신을 소개하는 글을 출력하는 함수
 ---
 */

/*:
 ---
 4. 정수를 하나 입력받아 2의 배수 여부를 반환하는 함수
 ---
 */

/*:
 ---
 5. 정수를 두 개 입력받아 곱한 결과를 반환하는 함수 (파라미터 하나의 기본 값은 10)
 ---
 */

/*:
 ---
  6. 4과목의 시험 점수를 입력 받아 평균 값을 반환해주는 함수
 ---
 */

/*:
 ---
  7. 점수( 문자 또는 숫자 ) 를 입력받아 학점( A. B. C... )를 반환하는 함수 만들기 ( 90점이상 A, 80점이상 B, 70점이상 C, 그 이하 F )
 ---
 */

/*:
 ---
 8. 점수( 문자 또는 숫자 )를 여러개 입력받아 평균에 대한 학점을 반환하는 함수 만들기  ( 90점이상 A, 80점이상 B, 70점이상 C, 그 이하 F )
 ---
 */
